SaumilTandon/Modbus-DIDO-Card-Project/stm32_f030k6t6_second2/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Relay_1_Pin GPIO_PIN_4
#define Relay_1_GPIO_Port GPIOA
#define Relay_2_Pin GPIO_PIN_5
#define Relay_2_GPIO_Port GPIOA
#define Relay_3_Pin GPIO_PIN_6
#define Relay_3_GPIO_Port GPIOA
#define Relay_4_Pin GPIO_PIN_7
#define Relay_4_GPIO_Port GPIOA
#define RS485_DE_RE_Pin GPIO_PIN_8
#define RS485_DE_RE_GPIO_Port GPIOA
#define Digital_Input_4_Pin GPIO_PIN_3
#define Digital_Input_4_GPIO_Port GPIOB
#define Digital_Input_3_Pin GPIO_PIN_4
#define Digital_Input_3_GPIO_Port GPIOB
#define Digital_Input_2_Pin GPIO_PIN_5
#define Digital_Input_2_GPIO_Port GPIOB
#define Digital_Input_1_Pin GPIO_PIN_6
#define Digital_Input_1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
